Repository: pigjr/VigilTip
Catalog: lib/l10n/app_*.arb
Languages: fr, zh

# homeHeadline
source: Scan a receipt, get tip suggestions
fr: Scannez une note, obtenez des suggestions de pourboire
zh: 扫描账单，获取小费建议

# homeSubhead
source: Based on pre-tax amount, rounded options with a reason for each
fr: Sur la base du montant hors taxes, options arrondies avec une raison pour chaque
zh: 基于税前金额，多档取整建议，每档附理由

source: Scan receipt
fr: Scanner la note
zh: 扫描账单

# cameraPermissionDenied
source: Camera permission is required to scan receipts
fr: L'accès à la caméra est nécessaire pour scanner les notes
zh: 需要相机权限才能扫描账单

source: No camera found
fr: Aucune caméra trouvée
zh: 未找到相机

# cameraNotSupportedOnPlatform
source: Camera is not supported on this platform. Use an Android device to scan receipts.
fr: La caméra n'est pas prise en charge sur cette plateforme. Utilisez un appareil Android pour scanner les notes.
zh: 当前平台不支持相机，请使用 Android 设备扫描账单。

# cameraInitFailed
source: Camera failed to start: {description}
fr: Échec du démarrage de la caméra : {description}
zh: 相机初始化失败: {description}

# captureFailed
source: Capture failed: {description}
fr: Échec de la prise : {description}
zh: 拍照失败: {description}

source: Retry
fr: Réessayer
zh: 重试

source: Back
fr: Retour
zh: 返回

source: Processing...
fr: Traitement...
zh: 处理中...

source: Capture
fr: Prendre
zh: 拍照

# pickImageFromGallery
source: Pick from gallery
fr: Choisir depuis la galerie
zh: 从相册选择

source: Tip suggestions
fr: Suggestions de pourboire
zh: 小费建议

source: Recognizing receipt...
fr: Reconnaissance de la note...
zh: 正在识别账单...

# receiptNotRecognized
source: Could not read the receipt. Try again or ensure good lighting.
fr: Impossible de lire la note. Réessayez ou assurez un bon éclairage.
zh: 无法识别账单，请重拍或确保光线充足

# amountNotRecognized
source: Could not read amounts. Try again or ensure the receipt is clear.
fr: Impossible de lire les montants. Réessayez ou assurez que la note est lisible.
zh: 无法识别账单金额，请重拍或确保账单清晰

source: Retake
fr: Reprendre
zh: 重拍

source: Back to home
fr: Retour à l'accueil
zh: 返回首页

source: Receipt summary
fr: Résumé de la note
zh: 账单摘要

source: Subtotal (pre-tax)
fr: Sous-total (hors taxes)
zh: 税前小计

# totalNoSubtotal
source: Total (no subtotal found)
fr: Total (sous-total non trouvé)
zh: 总价（未识别到税前）

source: Tax
fr: Taxes
zh: 税

source: Total
zh: 合计

# gratuityIncluded
source: Bill already includes tip or service charge
fr: La note inclut déjà le pourboire ou le service
zh: 账单已包含小费/服务费

source: Tip suggestions (based on pre-tax)
fr: Suggestions de pourboire (sur base hors taxes)
zh: 小费建议（基于税前）

source: Suggestion
fr: Pas de pourboire
zh: 无需小费

source: Scan another receipt
fr: Scanner une autre note
zh: 扫描另一张账单

# noTipReason
source: Bill already includes tip or service charge; no need to add more.
fr: La note inclut déjà le pourboire ou le service ; pas besoin d'ajouter.
zh: 账单已包含小费/服务费，通常无需再付小费

# tipReasonLow
source: About 5% tip, rounded total
fr: Environ 5% de pourboire, total arrondi
zh: 约5%小费，凑整支付

# tipReasonMedium
source: About 10% tip, rounded total
fr: Environ 10% de pourboire, total arrondi
zh: 约10%小费，凑整支付

# tipReasonHigh
source: About 15% tip, rounded total
fr: Environ 15% de pourboire, total arrondi
zh: 约15%小费，凑整支付

# disclaimerTitle
source: Important Notice
fr: Avis Important
zh: 重要提示

# disclaimerText
source: The following tip suggestions are for reference only. This app assumes no legal liability. Please decide tip amounts based on actual service quality.
fr: Les suggestions de pourboire suivantes sont à titre de référence uniquement. Cette application n'assume aucune responsabilité légale. Veuillez décider des montants de pourboire en fonction de la qualité réelle du service.
zh: 以下小费建议仅供参考，本应用不承担任何法律责任。请根据实际服务质量自行决定小费金额。

# appMotto
source: Think before you act
fr: Pensez avant d'agir
zh: 三思而后行

source: Privacy Policy
fr: Politique de confidentialité
zh: 隐私政策

source: Data Collection
fr: Collecte de données
zh: 数据收集

# dataCollectionContent
source: VigilTip only collects the following information when you actively use the app: • Camera permission: To capture receipt photos • Image data: Processed locally, not uploaded to servers • Device information: App version and system info (for service improvement)
fr: VigilTip ne collecte les informations suivantes que lorsque vous utilisez activement l'application : • Autorisation de l'appareil photo : Pour capturer des photos de reçus • Données d'image : Traitées localement, non téléchargées sur des serveurs • Informations sur l'appareil : Version de l'application et infos système (pour l'amélioration du service)
zh: VigilTip仅在您主动使用时收集以下信息： • 相机权限：用于拍摄收据照片 • 图片数据：仅在本地处理，不上传到服务器 • 设备信息：应用版本和系统信息（用于改进服务）

source: Data Usage
fr: Utilisation des données
zh: 数据使用

# dataUsageContent
source: We use collected data solely for: • Receipt text recognition (local processing) • Tip calculation (local processing) • App feature improvement • Error diagnosis and fixes
fr: Nous utilisons les données collectées uniquement pour : • Reconnaissance de texte sur les reçus (traitement local) • Calcul de pourboire (traitement local) • Amélioration des fonctionnalités de l'application • Diagnostic et correction d'erreurs
zh: 我们收集的数据仅用于： • 收据文字识别（本地处理） • 小费计算（本地处理） • 应用功能改进 • 错误诊断和修复

source: Data Storage
fr: Stockage des données
zh: 数据存储

# dataStorageContent
source: • All image processing is completed locally • We do not store your receipt photos • No personal data is uploaded to the cloud • App settings are saved only on your local device
fr: • Tout le traitement d'image est effectué localement • Nous ne stockons pas vos photos de reçus • Aucune donnée personnelle n'est téléchargée sur le cloud • Les paramètres de l'application sont sauvegardés uniquement sur votre appareil local
zh: • 所有图片处理均在本地完成 • 我们不会存储您的收据照片 • 不会将个人数据上传到云端 • 应用设置仅保存在本地设备

source: User Rights
fr: Droits de l'utilisateur
zh: 用户权利

# userRightsContent
source: You have the right to: • Access this privacy policy at any time • Deny camera permission (but this affects core functionality) • Uninstall the app to delete all local data • Contact us with privacy-related questions
fr: Vous avez le droit de : • Accéder à cette politique de confidentialité à tout moment • Refuser l'autorisation de l'appareil photo (mais cela affecte les fonctionnalités principales) • Désinstaller l'application pour supprimer toutes les données locales • Nous contacter pour des questions relatives à la confidentialité
zh: 您有权： • 随时访问本隐私政策 • 拒绝相机权限（但会影响核心功能） • 卸载应用以删除所有本地数据 • 联系我们询问隐私相关问题

source: Contact Us
fr: Nous contacter
zh: 联系我们

# contactUsContent
source: For privacy-related questions, please contact us through: • Email: privacy@vigiltip.app • In-app feedback: Settings page We will respond to your inquiries as soon as possible.
fr: Pour les questions relatives à la confidentialité, veuillez nous contacter par : • Email : privacy@vigiltip.app • Commentaires dans l'application : Page des paramètres Nous répondrons à vos demandes dès que possible.
zh: 如有隐私相关问题，请通过以下方式联系我们： • 应用商店：通过应用商店列表联系 • 应用内反馈：设置页面 我们会在收到您的询问后尽快回复。

# lastUpdated
source: Last updated: February 2026
fr: Dernière mise à jour : février2026
zh: 最后更新：2026年2月

source: Settings
fr: Paramètres
zh: 设置

source: About
fr: À propos
zh: 关于

source: About App
fr: À propos de l'application
zh: 关于应用

source: Version
zh: 版本

source: Developer
fr: Développeur
zh: 开发者

# appDescription
source: VigilTip is an intelligent tip calculator app that automatically recognizes receipt amounts through camera capture and provides three smart tip suggestions.
fr: VigilTip est une application de calcul de pourboire intelligente qui reconnaît automatiquement les montants des reçus par capture photo et fournit trois suggestions de pourboire intelligentes.
zh: VigilTip是一款智能小费计算应用，通过拍照自动识别收据金额，提供三种智能小费建议。

source: Manual Input
fr: Saisie Manuelle
zh: 手动输入金额

source: Enter Bill Amount
fr: Saisir le Montant de la Facture
zh: 手动输入账单金额

source: Amount
fr: Montant
zh: 金额

source: Calculate Tip
fr: Calculer le Pourboire
zh: 计算小费

source: Cancel
fr: Annuler
zh: 取消

# enterValidAmount
source: Please enter a valid amount
fr: Veuillez saisir un montant valide
zh: 请输入有效的金额

source: Algorithm Explanation
fr: Explication de l'Algorithme
zh: 算法说明

source: Algorithm Overview
fr: Aperçu de l'Algorithme
zh: 算法概述

# algorithmOverviewContent
source: VigilTip uses a three-tier intelligent tip suggestion system that provides reasonable tip recommendations based on bill amount and service context. The algorithm is based on these principles: fairness, practicality, and cultural adaptability.
fr: VigilTip utilise un système de suggestions de pourboire intelligent à trois niveaux qui fournit des recommandations de pourboire raisonnables basées sur le montant de la facture et le contexte du service. L'algorithme est basé sur ces principes : équité, praticité et adaptabilité culturelle.
zh: VigilTip采用三层智能小费建议系统，根据账单金额和服务情况提供合理的小费建议。算法基于以下原则：公平性、实用性、文化适应性。

# threeTierSystem
source: Three-Tier Suggestion System
fr: Système de Suggestions à Trois Niveaux
zh: 三层建议系统

# threeTierSystemContent
source: We provide three different tip suggestion tiers, each suitable for different scenarios and preferences: • Conservative suggestions: For budget-conscious or average service situations • Standard suggestions: For typical restaurant service quality • Generous suggestions: For excellent service or special occasions
fr: Nous fournissons trois niveaux de suggestions de pourboire différents, chacun adapté à différents scénarios et préférences : • Suggestions conservatrices : Pour les situations soucieuses du budget ou de service moyen • Suggestions standard : Pour la qualité de service typique des restaurants • Suggestions généreuses : Pour un service excellent ou des occasions spéciales
zh: 我们提供三个不同的小费建议层级，每个层级适用于不同的场景和偏好： • 保守型建议：适合预算有限或服务一般的情况 • 标准建议：适合常规服务质量的餐厅 • 慷慨型建议：适合优质服务或特殊场合

# tier1Explanation
source: Tier 1: Conservative Suggestions
fr: Niveau 1 : Suggestions Conservatrices
zh: 第一层：保守建议

# tier1ExplanationContent
source: Goal: Provide economical tip options Features: • Typically under 10% rate • Prioritizes rounded payments • Suitable for small bills (usually under $40) • Considers basic service costs Use cases: • Fast food, coffee shops • Average service quality • Budget-conscious situations
fr: Objectif : Fournir des options de pourboire économiques Caractéristiques : • Taux généralement inférieur à 10% • Priorise les paiements arrondis • Convient aux petites factures (généralement sous 40$) • Considère les coûts de service de base Cas d'usage : • Fast-food, cafés • Qualité de service moyenne • Situations soucieuses du budget
zh: 目标：提供经济实惠的小费选择 特点： • 通常低于10%的费率 • 优先考虑凑整支付 • 适合小额账单（通常低于$40） • 考虑基本服务成本 适用场景： • 快餐店、咖啡店 • 服务质量一般 • 预算有限的情况

# tier2Explanation
source: Tier 2: Standard Suggestions
fr: Niveau 2 : Suggestions Standard
zh: 第二层：标准建议

# tier2ExplanationContent
source: Goal: Provide conventional standard tips Features: • Approximately 10% rate • Balanced consideration of service quality • Suitable for medium bill amounts • Uses reasonable rounding strategies Use cases: • Regular restaurant dining • Standard service quality • Everyday dining situations
fr: Objectif : Fournir des pourboires standard conventionnels Caractéristiques : • Taux approximatif de 10% • Considération équilibrée de la qualité du service • Convient aux montants de factures moyens • Utilise des stratégies d'arrondi raisonnables Cas d'usage : • Restaurant standard • Qualité de service standard • Situations de restauration quotidiennes
zh: 目标：提供符合常规标准的小费 特点： • 接近10%的费率 • 平衡考虑服务质量 • 适合中等金额账单 • 采用合理的凑整策略 适用场景： • 常规餐厅用餐 • 标准服务质量 • 日常用餐情况

# tier3Explanation
source: Tier 3: Generous Suggestions
fr: Niveau 3 : Suggestions Généreuses
zh: 第三层：慷慨建议

# tier3ExplanationContent
source: Goal: Provide tips that recognize excellent service Features: • Approximately 15% rate • Emphasizes service quality • Suitable for higher bill amounts • Reflects generous attitude Use cases: • Fine dining restaurants • Excellent service experiences • Special occasion celebrations
fr: Objectif : Fournir des pourboires qui reconnaissent un service excellent Caractéristiques : • Taux approximatif de 15% • Met l'accent sur la qualité du service • Convient aux montants de factures plus élevés • Reflète une attitude généreuse Cas d'usage : • Restaurants haut de gamme • Expériences de service excellentes • Célébrations d'occasions spéciales
zh: 目标：提供体现优质服务认可的小费 特点： • 接近15%的费率 • 重视服务质量 • 适合较高金额账单 • 体现慷慨态度 适用场景： • 高档餐厅 • 优质服务体验 • 特殊场合庆祝

source: Rounding Rules
fr: Règles d'Arrondi
zh: 凑整规则

# roundingRulesContent
source: To make tip amounts more practical, we use intelligent rounding strategies: • Small bills (<$40): Round to whole numbers • Medium bills ($40-$100): Round to 5 or 0 endings • Large bills (>$100): Round to 10 or 0 endings • Prioritizes ease of payment for total amount These rules ensure tip totals are convenient for cash or electronic payments.
fr: Pour rendre les montants de pourboire plus pratiques, nous utilisons des stratégies d'arrondi intelligentes : • Petites factures (<40$) : Arrondir aux nombres entiers • Factures moyennes (40-100$) : Arrondir aux terminaisons 5 ou 0 • Grandes factures (>100$) : Arrondir aux terminaisons 10 ou 0 • Priorise la facilité de paiement du montant total Ces règles garantissent que les totaux de pourboire sont pratiques pour les paiements en espèces ou électroniques.
zh: 为了让小费金额更实用，我们采用智能凑整策略： • 小额账单（<$40）：凑整到整数 • 中等账单（$40-$100）：凑整到5或0结尾 • 大额账单（>$100）：凑整到10或0结尾 • 优先考虑总金额的易支付性 这些规则确保小费总额便于现金或电子支付。

source: Example Calculations
fr: Exemples de Calculs
zh: 计算示例

# exampleCalculationsContent
source: Example 1: Bill $25.50 • Conservative: $3.50 (13.8%, rounded to $29) • Standard: $5.50 (21.6%, rounded to $31) • Generous: $7.50 (29.4%, rounded to $33) Example 2: Bill $68.25 • Conservative: $8.75 (12.8%, rounded to $77) • Standard: $11.75 (17.2%, rounded to $80) • Generous: $16.75 (24.6%, rounded to $85) Example 3: Bill $125.00 • Conservative: $15.00 (12%, rounded to $140) • Standard: $25.00 (20%, rounded to $150) • Generous: $35.00 (28%, rounded to $160)
fr: Exemple 1 : Facture 25,50$ • Conservateur : 3,50$ (13,8%, arrondi à 29$) • Standard : 5,50$ (21,6%, arrondi à 31$) • Généreux : 7,50$ (29,4%, arrondi à 33$) Exemple 2 : Facture 68,25$ • Conservateur : 8,75$ (12,8%, arrondi à 77$) • Standard : 11,75$ (17,2%, arrondi à 80$) • Généreux : 16,75$ (24,6%, arrondi à 85$) Exemple 3 : Facture 125,00$ • Conservateur : 15,00$ (12%, arrondi à 140$) • Standard : 25,00$ (20%, arrondi à 150$) • Généreux : 35,00$ (28%, arrondi à 160$)
zh: 示例1：账单$25.50 • 保守建议：$3.50（约13.8%，凑整到$29） • 标准建议：$5.50（约21.6%，凑整到$31） • 慷慨建议：$7.50（约29.4%，凑整到$33） 示例2：账单$68.25 • 保守建议：$8.75（约12.8%，凑整到$77） • 标准建议：$11.75（约17.2%，凑整到$80） • 慷慨建议：$16.75（约24.6%，凑整到$85） 示例3：账单$125.00 • 保守建议：$15.00（12%，凑整到$140） • 标准建议：$25.00（20%，凑整到$150） • 慷慨建议：$35.00（28%，凑整到$160）

source: Transparency Commitment
fr: Engagement de Transparence
zh: 透明度承诺

# transparencyCommitmentContent
source: We commit to complete algorithm transparency: • All calculation logic fully explained • No hidden complex rules • Welcome user feedback and suggestions • Continuously optimize algorithm fairness We believe transparency builds user trust and makes every tipping decision more informed.
fr: Nous nous engageons à une transparence complète de l'algorithme : • Toute la logique de calcul pleinement expliquée • Aucune règle complexe cachée • Bienvenue aux retours et suggestions des utilisateurs • Optimisation continue de l'équité de l'algorithme Nous croyons que la transparence construit la confiance des utilisateurs et rend chaque décision de pourboire plus éclairée.
zh: 我们承诺算法的完全透明： • 所有计算逻辑公开说明 • 不隐藏任何复杂规则 • 欢迎用户反馈和建议 • 持续优化算法公平性 我们相信透明度能够建立用户信任，让每个小费决策都更加明智。

# whyTransparent
source: Why Choose Transparency?
fr: Pourquoi Choisir la Transparence ?
zh: 为什么选择透明？

# whyTransparentContent
source: In the digital age, algorithm transparency is the foundation of user trust. We disclose our tip calculation logic because: • You have the right to know where suggestions come from • Transparency promotes algorithm fairness • Helps you make informed decisions • Builds long-term user trust VigilTip is committed to being your most trusted tip calculation partner.
fr: À l'ère numérique, la transparence des algorithmes est le fondement de la confiance des utilisateurs. Nous divulguons notre logique de calcul de pourboire parce que : • Vous avez le droit de savoir d'où viennent les suggestions • La transparence favorise l'équité des algorithmes • Aide à prendre des décisions éclairées • Construit la confiance à long terme des utilisateurs VigilTip s'engage à être votre partenaire de calcul de pourboire le plus digne de confiance.
zh: 在数字时代，算法透明度是用户信任的基础。我们公开小费计算逻辑，因为： • 您有权知道建议的来源 • 透明度促进算法公平性 • 帮助您做出明智决策 • 建立长期用户信任 VigilTip致力于成为您最值得信赖的小费计算伙伴。

# recognizingReceiptContent
source: Recognizing receipt content, please wait...
fr: Reconnaissance du contenu de la facture, veuillez patienter...
zh: 正在识别账单内容，请稍候...

# viewRawText
source: View Raw Recognized Text
fr: Voir le Texte Brut Reconnu
zh: 查看识别的原始文本

# rawTextDescription
source: Display original text content from OCR recognition
fr: Afficher le contenu textuel original de la reconnaissance OCR
zh: 显示OCR识别的原始文字内容

source: Back to Camera
fr: Retour à l'Appareil Photo
zh: 返回拍照

source: lines of text
fr: lignes de texte
zh: 行文本

source: Manual Input Amount: $
fr: Montant Saisi Manuellement: $
zh: 手动输入金额: $

source: Retake Photo
fr: Reprendre Photo
zh: 重新拍照

source: OCR Recognition Result:
fr: Résultat de la Reconnaissance OCR:
zh: OCR 识别结果：

source: [Empty Line]
fr: [Ligne Vide]
zh: [空行]

source: Bill Contains Service Charge
fr: La Facture Contient des Frais de Service
zh: 账单已包含服务费

source: Service Charge Amount
fr: Montant des Frais de Service
zh: 服务费金额

# preTaxPercentage
source: % Pre-tax
fr: % Avant Impôt
zh: % 税前

source: Total Payment
fr: Paiement Total
zh: 总计支付

source: High Tip Amount
fr: Montant de Pourboire Élevé
zh: 小费金额较高

# highTipWarning
source: The lowest tip option exceeds $20. Please check if the bill amount is correct, or consider manually entering the accurate amount.
fr: L'option de pourboire la plus basse dépasse 20$. Veuillez vérifier si le montant de la facture est correct, ou envisagez de saisir manuellement le montant exact.
zh: 最低档小费已超过 $20，请检查账单金额是否正确，或考虑手动输入准确的金额。
